[A_ChaosMagic_HeroAbility H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="混沌魔法"
mTooltip=""

[A_ChaosMagic_Buff_DeadlyStrike H7BaseBuff]
mName="幸运"
mTooltip="伤害提高75%。"

[A_DeadlyStrike_Buff H7BaseBuff]
mName="幸运"
mTooltip="伤害提高75%。"

[A_FickleMagic_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_PerfectStrike_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="完美一击"
mTooltip="友方生物的暴击无法被反击。"

[A_BlessedGround_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="福佑大地"
mTooltip="总督：此城镇控制区内的所有友方英雄获得 %buff1.buff.stat %buff1.buff.stat.icon 命运。"

[A_DeadlyStrike_CreatureAbility_Luck H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="致命打击"
mTooltip="工具提示"

[A_PerfectStrike_CreatureAbility H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="完美一击"
mTooltip="该生物的暴击无法被反击。"

[A_ChaosMagic_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="混沌魔法"
mTooltip="英雄施放伤害法术时，会基于命运进行一次幸运检定。成功的检定可将法术伤害提高至 %spell.spell.buff1.buff.special（拥有致命打击时为 %spell.spell.buff2.buff.special）。"

[A_PerfectStrike_Buff_SuppressRetaliation H7BaseBuff]
mName="无法反击"
mTooltip=""

[A_FickleMagic_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法突变"
mTooltip="敌方施放在你控制生物身上的法术和魔法效果有 %spell1.spell.buff.chance% 的几率失败。"

[A_BlessedGround_Buff H7BaseBuff]
mName="福佑大地"
mTooltip="此控制区内 %stat %stat.icon 命运"

[A_FickleMagic_CreatureAbility H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法突变"
mTooltip=""

UCP MOD

[A_DeadlyStrike_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="致命打击"
mTooltip="友方生物的暴击现在造成200%伤害，而非150%。"

UCP 1.2

[A_TreasureFinder_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="夺宝奇兵"
mTooltip="英雄拾取的宝箱多包含 %stat1.norm %icon_Gold 黄金。"

[A_TravellersLuck_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="旅者之运"
mTooltip="英雄每周（第一周除外）获得一个随机的临时增益。"

v1.41

[A_Destiny_Skill H7Skill]
mName="命运"
mTooltip="命运技能工具提示"
mDescriptions[0]="提高英雄的 %stat1.icon 命运。"
mDescriptions[1]=""
mDescriptions[2]="英雄的 %stat1.icon 命运提高 %stat1.norm。"
mDescriptions[3]="英雄的 %stat1.icon 命运额外提高 %stat1.norm。"
mDescriptions[4]="英雄的 %stat1.icon 命运额外提高 %stat1.norm。\n\n与大师级<font color="#00588BFF">土系魔法</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：命运之花。"